![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png)

# <center> LESSON 5: Introduction to PANDAS </center>

## 1. INTRODUCTION

### 1.1 What is Pandas?

`Pandas = Panel Data`

### 1.2 Installation

- Cài đặt khi tạo môi trường ảo:
```
conda create -n hanh python=3.7 pandas
```
- Cài đặt sau khi tạo xong môi trường ảo:
```
conda install pandas
```
hoặc 
```
pip install pandas
```

### 1.3 Import

In [2]:
import pandas as pd

**Reference**: 
- [Pandas Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [Python for Data Analysis](https://bedford-computing.co.uk/learning/wp-content/uploads/2015/10/Python-for-Data-Analysis.pdf)

## 2. BASICS

### 2.1 Objects in Pandas

- **DataFrame**: table, `pd.DataFrame()`
- **Series**: column, `pd.Series()`

![](https://media.geeksforgeeks.org/wp-content/cdn-uploads/creating_dataframe1.png)
![](https://analyticssavvy.com/wp-content/uploads/2020/05/series-and-dataframe.png)

#### 2.1.1 How to create a DataFrame

1. Tạo ra 1 DataFrame rỗng

In [4]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [5]:
type(df)

pandas.core.frame.DataFrame

2. Tạo ra 1 DataFrame từ dict

In [8]:
dict1 = {'name':['Cuong','Mai','Pha','Nghia'],
         'age':[10,15,13,21],
         'university':['MIT','HAV','FTU','NEU']}
df1 = pd.DataFrame(dict1)
df1

    name  age university
0  Cuong   10        MIT
1    Mai   15        HAV
2    Pha   13        FTU
3  Nghia   21        NEU

In [9]:
df1 = pd.DataFrame(dict1, index = ['studen1','studen2','studen3','studen4']) = df1 = pd.DataFrame(dict1, index = [f'studen{i}'for i in range(1,5)]) # f là để ép biến i vào trong bảng
df1

          name  age university
studen1  Cuong   10        MIT
studen2    Mai   15        HAV
studen3    Pha   13        FTU
studen4  Nghia   21        NEU

3. Tạo ra 1 DataFrame từ list của list

In [12]:
li=(['Cuong',10,'MIT'],['Mai',12,'HAV'],['Nghia',21,'NEU'])
df2 = pd.DataFrame(li, columns = ['name', 'age','university'])
df2

    name  age university
0  Cuong   10        MIT
1    Mai   12        HAV
2  Nghia   21        NEU

4. Tạo ra 1 DataFrame từ zip

In [16]:
name= ['Cuong','Mai','Pha','Nghia']
age = [10,15,13,21]
university = ['MIT','HAV','FTU','NEU']
df3 = pd.DataFrame(list(zip(name,age,university)),  columns = ['name', 'age','university'])
df3

    name  age university
0  Cuong   10        MIT
1    Mai   15        HAV
2    Pha   13        FTU
3  Nghia   21        NEU

5. Tạo từ 1 chuỗi numpy

In [21]:
import numpy as np
df4 = pd.DataFrame(np.linspace(1,16,16).reshape(4,4))
df4

      0     1     2     3
0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0
2   9.0  10.0  11.0  12.0
3  13.0  14.0  15.0  16.0

#### 2.1.2 How to create a Series

In [26]:
pd.Series({'name':['Cuong','Nghia','Mai']})

nam    [Cuong, Nghia, Mai]
dtype: object

In [27]:
df2['name']
#tra ve nhiều cột
#Làm việc với các biến có dấu cách hay hoặc dấu câu

0    Cuong
1      Mai
2    Nghia
Name: name, dtype: object

In [28]:
df2.name
#trả về một cốt

0    Cuong
1      Mai
2    Nghia
Name: name, dtype: object

### 2.2 I/O

Link: https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data

pd.read_{ten_kieu_file}:pd.read_csv(),pd.read_excel(), pd.read_sql()

pd.to_{ten_kieu_file}: pd.to_csv(),... (lưu)

In [1]:
df = pd.read_csv('Ecommerce Purchases')
df.head(5) # Lấy dòng từ trên xuống
df.tail(5) # Lấy từ dưới lên
df.sample(5) # Lấy random 5 mẫu từ file data

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\r\nAlexisborough, NE ...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\r\nSouth John, TN...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\r\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\r\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\r\nNew Cynthia, TX...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [31]:
iris = pd.read_csv('iris.data', header = None) 
# biến có thể gán link trên mạng về, không cần download về ámt
# Chú ý phải dùng thêm tham số để tránh lấy dữ liệu cột đầu tiên làm tên cột
iris

       0    1    2    3               4
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [4]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', header = None)
iris.head(5)

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [1]:
import seaborn as sns
iris2 = sns.load_dataset('iris')
iris2.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [6]:
iris.to_csv('nghia_sample_iris.csv')

### 2.3 Indexing

Chọn tất cả các dòng (slicing):
- `loc`: location `df.loc[row_label,col_label]`, `series.loc[row_label]`
- `iloc`: index location `df.iloc[row_index,col_index]`, `series.iloc[row_index]`

Chọn 1 cell:
- `at`:  `df.at[row_label,col_label]`
- `iat`: `df.iat[row_index,col_index]`

### 2.4 Masking

### 2.5 Operations

#### 2.5.1 Groupby

![](https://blog.dask.org/images/split-apply-combine.png)

#### 2.5.2 Pivot

#### 2.5.3 Others

|Merge methods| SQL Join Name | Meaning| _merge|
|-|-|-|-|
|left| LEFT OUTER JOIN|Chỉ sử dụng keys bên trái|left_only|
|right| RIGHT OUTER JOIN|Chỉ sử dụng keys bên phải|right_only|
|outer|FULL OUTER JOIN|Sử dụng keys của cả 2 dataframes|both|
|inner|INNER JOIN|Chỉ sử dụng keys giao nhau của 2 dataframes|both|

![](https://lh3.googleusercontent.com/-n76c6dtr5sw/YBO5d-3PzGI/AAAAAAAAAh8/xiT6YIzePLEXArb8uU1f1vgg8JRXYeg8ACLcBGAsYHQ/image.png)